
class FAQData:
    faq_answers = [
        [0, "Сутки — 400 рублей. Оплата курьеру — наличными или картой."],
        [1, "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."],
        [2, "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."],
        [3, "Только начиная с завтрашнего дня. Но скоро станем расторопнее."],
        [4, "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."],
        [5, "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."],
        [6, "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."],
        [7, "Да, обязательно. Всем самокатов! И Москве, и Московской области."]
    ]


class OrderTestOne: # Набор данных 1
    name_one = "Иван"
    surname_one = "Петров"
    address_one = "ул. Ленина, 5"
    metro_station_one = "Сокольники"
    phone_one = "89991112233"
    date_one = "13.03.2026"
    comment_one = "Позвонить за час"
    

   
class OrderTestTwo:# Набор данных 2
    name_two = "Екатерина"
    surname_two = "Смирнова"
    address_two = "пр-т Мира, 10"
    metro_station_two = "Комсомольская"
    phone_two = "89005556677"
    date_two = "14.03.2026"
    comment_two = "Позвонить за два часа"
    